In [1]:
import pandas as pd

In [2]:
my_list = [1, 2, 3, 4]

In [3]:
my_list

[1, 2, 3, 4]

In [4]:
my_list = ['Football', 'Basketball', 'Hockey']

In [5]:
my_list

['Football', 'Basketball', 'Hockey']

In [6]:
my_list.append('Volleball')

In [7]:
my_list

['Football', 'Basketball', 'Hockey', 'Volleball']

In [11]:
my_list[1:2:]

['Basketball']

In [14]:
dictionary = {'S&P500':[1250, 1253, 1252, 1264], 'DownJones':[6423942, 214231, 41234]}

In [15]:

dictionary

{'S&P500': [1250, 1253, 1252, 1264], 'DownJones': [6423942, 214231, 41234]}

In [16]:
dictionary['IBEX'] = [321432, 123412, 1234]

In [17]:

dictionary

{'S&P500': [1250, 1253, 1252, 1264],
 'DownJones': [6423942, 214231, 41234],
 'IBEX': [321432, 123412, 1234]}

In [18]:
for key, value in dictionary.items():
    print(key, value)

S&P500 [1250, 1253, 1252, 1264]
DownJones [6423942, 214231, 41234]
IBEX [321432, 123412, 1234]

In [19]:
for key, value in dictionary.items():
    if key == 'S&P500':
        print(value)

[1250, 1253, 1252, 1264]

In [20]:
number_list = [0,1,2,3,4,5]
new_list = []
for el in number_list:
    new_list.append(el + 2)
new_list

[2, 3, 4, 5, 6, 7]

In [21]:
# List comprehensions
new_list = [el + 2 for el in number_list]

In [22]:

new_list

[2, 3, 4, 5, 6, 7]

In [24]:
def square_number(number):
    """
    Compute the square of a number
    """
    return number**2

In [26]:
result = square_number(12)
result

144

In [40]:
def trim_cities(my_list, max_lenght):
    """
    Trim cities by lenght 
    """
    result = []
    for el in my_list:
        if len(el) <= max_lenght:
            result.append(el)
    return result

def main(my_list, max_length):
    """
    Main function to deal with a list of  cities
    """
    result = trim_cities(my_list, max_length)
    # return result
    return result


    #More work

In [42]:
my_list = ['Barcelona', 'Madrid', 'Valencia', 'Sevilla']
result = main(my_list, 7)
result

['Madrid', 'Sevilla']

In [43]:
import pandas as pd

In [46]:
df = pd.read_csv('BooksDatasetClean.csv')
df.head()

,Title,Authors,Description,Category,Publisher,Price Starting With ($),Publish Date (Month),Publish Date (Year)
0,Goat Brothers,"By Colton, Larry",NaN,"History , General",Doubleday,8.79,January,1993
1,The Missing Person,"By Grumbach, Doris",NaN,"Fiction , General",Putnam Pub Group,4.99,March,1981
2,Don't Eat Your Heart Out Cookbook,"By Piscatella, Joseph C.",NaN,"Cooking , Reference",Workman Pub Co,4.99,September,1983
3,When Your Corporate Umbrella Begins to Leak: A...,"By Davis, Paul D.",NaN,NaN,Natl Pr Books,4.99,April,1991
4,Amy Spangler's Breastfeeding : A Parent's Guide,"By Spangler, Amy",NaN,NaN,Amy Spangler,5.32,February,1997

In [47]:
df.columns

Index(['Title', 'Authors', 'Description', 'Category', 'Publisher',
       'Price Starting With ($)', 'Publish Date (Month)',
       'Publish Date (Year)'],
      dtype='object')

In [48]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 103063 entries, 0 to 103062
Data columns (total 8 columns):
 #   Column                   Non-Null Count   Dtype
---  ------                   --------------   -----
 0   Title                    103063 non-null  object
 1   Authors                  103063 non-null  object
 2   Description              70204 non-null   object
 3   Category                 76902 non-null   object
 4   Publisher                103055 non-null  object
 5   Price Starting With ($)  103063 non-null  float64
 6   Publish Date (Month)     103063 non-null  object
 7   Publish Date (Year)      103063 non-null  int64
dtypes: float64(1), int64(1), object(6)
memory usage: 6.3+ MB

In [49]:
df.describe()

       Price Starting With ($)  Publish Date (Year)
count            103063.000000        103063.000000
mean                  6.777172          1994.522865
std                   8.932151            13.193129
min                   4.890000          1755.000000
25%                   4.990000          1989.000000
50%                   5.290000          1997.000000
75%                   5.700000          2003.000000
max                1095.000000          2023.000000

In [50]:
df.isna().sum()

Title                          0
Authors                        0
Description                32859
Category                   26161
Publisher                      8
Price Starting With ($)        0
Publish Date (Month)           0
Publish Date (Year)            0
dtype: int64

In [53]:
df.shape

(103063, 8)

In [52]:
expensive_books = df[df['Price Starting With ($)'] > 12]
expensive_books.shape

(4996, 8)

In [54]:
df.columns

Index(['Title', 'Authors', 'Description', 'Category', 'Publisher',
       'Price Starting With ($)', 'Publish Date (Month)',
       'Publish Date (Year)'],
      dtype='object')

In [58]:
new_df = df[['Title', 'Authors', 'Price Starting With ($)']]

In [60]:
new_df.head()

,Title,Authors,Price Starting With ($)
0,Goat Brothers,"By Colton, Larry",8.79
1,The Missing Person,"By Grumbach, Doris",4.99
2,Don't Eat Your Heart Out Cookbook,"By Piscatella, Joseph C.",4.99
3,When Your Corporate Umbrella Begins to Leak: A...,"By Davis, Paul D.",4.99
4,Amy Spangler's Breastfeeding : A Parent's Guide,"By Spangler, Amy",5.32

In [61]:
new_list = []
for el in new_df['Price Starting With ($)']:
    if el <= 12: 
        new_list.append('Cheap')
    else:
        new_list.append('Expensive')
df['Label Price'] = new_list
df.head()

,Title,Authors,Description,Category,Publisher,Price Starting With ($),Publish Date (Month),Publish Date (Year),Label Price
0,Goat Brothers,"By Colton, Larry",NaN,"History , General",Doubleday,8.79,January,1993,Cheap
1,The Missing Person,"By Grumbach, Doris",NaN,"Fiction , General",Putnam Pub Group,4.99,March,1981,Cheap
2,Don't Eat Your Heart Out Cookbook,"By Piscatella, Joseph C.",NaN,"Cooking , Reference",Workman Pub Co,4.99,September,1983,Cheap
3,When Your Corporate Umbrella Begins to Leak: A...,"By Davis, Paul D.",NaN,NaN,Natl Pr Books,4.99,April,1991,Cheap
4,Amy Spangler's Breastfeeding : A Parent's Guide,"By Spangler, Amy",NaN,NaN,Amy Spangler,5.32,February,1997,Cheap

In [63]:
df.groupby('Label Price').apply(lambda x: x['Publish Date (Year)'].median())

Label Price
Cheap        1998.0
Expensive    1984.0
dtype: float64

In [ ]:
# Filter out books 1999